#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<stdlib.h>
//
//猜名次
//
//作业内容
//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果：
//A选手说：B第二，我第三；
//B选手说：我第二，E第四；
//C选手说：我第一，D第二；
//D选手说：C最后，我第三；
//E选手说：我第四，A第一；
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。

//方法一
int checkData(int *p)
{
	int tmp[7] = { 0 }; //标记表，实际是哈希表的思路。一开始每个元素都是0。

	int i;
	for (i = 0; i < 5; i++)
	{
		if (tmp[p[i]]) //如果这个位置的标记已经是1，则代表重复，直接返回0。
		{
			return 0;
		}
		tmp[p[i]] = 1; //如果不是，则给这个位置标记为1。
	}
	return 1; //全部标记完毕也没有出现重复的情况，代表OK。
}

int main()
{
	int p[5]; //0 1 2 3 4分别代表a b c d e

	for (p[0] = 1; p[0] <= 5; p[0]++)
	{
		for (p[1] = 1; p[1] <= 5; p[1]++)
		{
			for (p[2] = 1; p[2] <= 5; p[2]++)
			{
				for (p[3] = 1; p[3] <= 5; p[3]++)
				{
					for (p[4] = 1; p[4] <= 5; p[4]++) //五层循环遍历
					{
						//这里是五个人的描述，由于比较表达式只有0和1两个结果，如果要两个条件有且只有一个为真，则可以用比较表达式的值总和为1的方式直接判定。别忘了还要判定不能并列。
						if ((p[1] == 2) + (p[0] == 3) == 1 && //B第二，我第三
							(p[1] == 2) + (p[4] == 4) == 1 && //我第二，E第四
							(p[2] == 1) + (p[3] == 2) == 1 && //我第一，D第二
							(p[2] == 5) + (p[3] == 3) == 1 && //C最后，我第三
							(p[4] == 4) + (p[0] == 1) == 1 && //我第四，A第一
							checkData(p) //不能并列
							)
						{
							for (int i = 0; i < 5; i++)
							{
								printf("%d ", p[i]);
							}
							putchar('\n');
						}
					}
				}
			}
		}
	}
	system("pause");
	return 0;
}

//方法二
//void swap(int *a, int *b)
//{
//	int t = *a;
//	*a = *b;
//	*b = t;
//}
//
//void corarray(int *p, int n)
//{
//	//printf("%d ", p[1]);
//	if (n >= 5)
//	{
//		if ((p[1] == 2) + (p[0] == 3) == 1 && //B第二，我第三
//			(p[1] == 2) + (p[4] == 4) == 1 && //我第二，E第四
//			(p[2] == 1) + (p[3] == 2) == 1 && //我第一，D第二
//			(p[2] == 5) + (p[3] == 3) == 1 && //C最后，我第三
//			(p[4] == 4) + (p[0] == 1) == 1)   //我第四，A第一
//		{
//			for (int i = 0; i < 5; i++)
//			{
//				printf("%d ", p[i]);
//			}
//			putchar('\n');
//		}
//	}
//	
//	int i;
//	for (i = n; i < 5; i++)
//	{
//		swap(p + i, p + n);
//		corarray(p, n + 1);
//		swap(p + i, p + n);
//	}
//}
//
//int main()
//{
//	int person[5] = { 1, 2, 3, 4, 5 };
//	corarray(person,0);
//
//	system("pause");
//	return 0;
//}

//猜凶手
//
//作业内容
//日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个嫌疑犯的一个。
//以下为4个嫌疑犯的供词 :
//A说：不是我。
//B说：是C。
//C说：是D。
//D说：C在胡说
//已知3个人说了真话，1个人说的是假话。
//现在请根据这些信息，写一个程序来确定到底谁是凶手。
//int main()
//{
//	int person[4] = { 0 };//默认清白为0
//	int i;
//	for (i = 0; i < 4; i++)
//	{
//		person[i] = 1;
//		if (((person[0]!=1)+(person[2]==1)+(person[3]==1)+(person[3]!=1)) == 3)
//		{
//			break;
//		}
//		person[i] = 0;
//	}
//	printf("凶手是 %c\n", 'A' + i);
//	system("pause");
//	return 0;
//}
//*****************************************************************************************
//模拟杨辉三角
//int main()
//{
//	/*printf("输入杨辉三角的行数：>");
//	int n;
//	scanf("%d", &n);
//	int i, j, s;
//	printf("1\n");
//	for (i = 2; i <= n; i++)
//	{	
//		s = 1;
//		printf("1 ");
//		for (j = 1; j <= i - 2; j++)
//		{
//			s = (i - j)*s / j;
//			printf("%d ", s);
//		}
//		printf("1\n");
//	}*/
//	int data[30] = { 1 };
//	int n = 5;
//	int i, j;
//	printf("1\n"); //第一行就直接打印了
//	for (i = 1; i < n; i++) //从第二行开始
//	{
//		for (j = i; j > 0; j--) //从后向前填，避免上一行的数据在使用前就被覆盖
//		{
//			data[j] += data[j - 1]; //公式同上，由于变成了一维，公式也变简单了。
//		}
//
//		for (j = 0; j <= i; j++) //这一行填完就直接打印了。
//		{
//			printf("%d ", data[j]);
//		}
//		putchar('\n');
//	}
//	system("pause");
//	return 0;
//}